---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRiser
source: html/50e4e22a-8e0d-6eef-3381-9b17345f52a6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateRiser Property

Can't create geometry for one or more risers.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRiser { get; }
```